sensissf _.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <env:Header />
    <env:Body>
        <UpdateListingSDF xmlns="http://amdocs/iam/ADAPTOR_WS/UpdateListingSDF_1">
            <ROOT xmlns="http://amdocs/iam/cyp/pubint/service/CreateListingSDFInput">
                <Event xmlns="" />
                    <DATA xmlns="">
                        <generalTxParams />
                        <transactionParams>
                            <listingEntity>
                                <listingPk>
                                    <listingId>@listingId@</listingId>
                                    <listingVersion>@listingVersion@</listingVersion>
                                </listingPk>
                                <atnNpa>@atnNpa@</atnNpa>
                                <atnCop>@atnCop@</atnCop>
                                <atnLineNo>@atnLineNo@</atnLineNo>
                                <listedTnNpa>@listedTnNpa@</listedTnNpa>
                                <listedTnCop>@listedTnCop@</listedTnCop>
                                <listedTnLineNo>@listedTnLineNo@</listedTnLineNo>
                                <nonStandardTn xsi:nil="true" />
                                <headingCode xsi:nil="true" />
                                <listedName>@listedName@</listedName>
                                <honoraryTitle>@honoraryTitle@</honoraryTitle>
                                <lineageTitle>@lineageTitle@</lineageTitle>
                                <designation>@designation@</designation>
                                <dialInst>@dialInst@</dialInst>
                                <rightJustifiedText>@rightJustifiedText@</rightJustifiedText>
                                <crossReferenceText>@crossReferenceText@</crossReferenceText>
                                <webAddress xsi:nil="true" />
                                <emailAddress xsi:nil="true" />
                                <aliCode>@aliCode@</aliCode>
                                <effectiveDate>
                                    <dateTimeString>@effectiveDate@</dateTimeString>
                                </effectiveDate>
                                <customerId>@customerId@</customerId>
                                <mainListingId>@mainListingId@</mainListingId>
                                <listingStatus>@listingStatus@</listingStatus>
                                <publishInd>@publishInd@</publishInd>
                                <lni>@lni@</lni>
                                <styleCode>@styleCode@</styleCode>
                                <brgInd>@brgInd@</brgInd>
                                <tnType>@tnType@</tnType>
                                <omitAddressInd>@omitAddressInd@</omitAddressInd>
                                <advanceInd>@advanceInd@</advanceInd>
                                <advCompletionDate>
                                    <dateTimeString>@advCompletionDate@</dateTimeString>
                                </advCompletionDate>
                                <pla>@pla@</pla>
                                <directiveText>@directiveText@</directiveText>
                                <rcfInd>@rcfInd@</rcfInd>
                                <openReason>@openReason@</openReason>
                                <transactionCode>@transactionCode@</transactionCode>
                                <disconnectReason>@disconnectReason@</disconnectReason>
                                <soType>@soType@</soType>
                                <associateInd>@associateInd@</associateInd>
                                <asscDisassCustId xsi:nil="true" />
                                <ypScopingEntInd xsi:nil="true" />
                                <ypScopingType>@ypScopingType@</ypScopingType>
                                <followStreetNum>@followStreetNum@</followStreetNum>
                                <followStrTypeSfx>@followStrTypeSfx@</followStrTypeSfx>
                            </listingEntity>
                            <addressEntity>
                                <listedAddressId xsi:nil="true" />
                                <streetNumPrefix>@streetNumPrefix@</streetNumPrefix>
                                <streetNo>@streetNo@</streetNo>
                                <streetName>@streetName@</streetName>
                                <streetTypeCode>@streetTypeCode@</streetTypeCode>
                                <streetDirectional>@streetDirectional@</streetDirectional>
                                <apartment>@apartment@</apartment>
                                <localityId>@localityId@</localityId>
                                <locNameOverride>@locNameOverride@</locNameOverride>
                                <stateNameOverride>@stateNameOverride@</stateNameOverride>
                                <countryName>@countryName@</countryName>
                                <postCode>@postCode@</postCode>
                                <poBox>@poBox@</poBox>
                                <optionalAddress>@optionalAddress@</optionalAddress>
                                <optionalAddrType>@optionalAddrType@</optionalAddrType>
                                <postalAddrType>@postalAddrType@</postalAddrType>
                                <poLocalityId>@poLocalityId@</poLocalityId>
                                <poPostCode>@poPostCode@</poPostCode>
                                <longitude xsi:nil="true" />
                                <latitude xsi:nil="true" />
                            </addressEntity>
                        </transactionParams>
                    </DATA>
                </ROOT>
            </UpdateListingSDF>
        </env:Body>
    </env:Envelope>